org-posts/posts.org
#+hugo_base_dir: ../
#+hugo_section: post

*** DONE Minimización de hojas de estilo                :minimizar:optimizar:
    CLOSED: [2019-10-21 lun 12:39]
    :PROPERTIES:
    :EXPORT_FILE_NAME: minimizacion_css
    :END:

La minimización de código tiene como objetivo *reducir el tamaño del archivo eliminando caracteres innecesarios*. Se utiliza en diseño web para reducir el tamaño de los archivos CSS y JavaScript y así reducir el tiempo de carga del sitio web.
#+hugo: more

El proceso de minimización es *distinto del de compresión*, ya que el archivo minimizado es totalmente compatible con el original y no requiere de un proceso previo (descompresión) para su correcta interpretación.

El procedimiento consiste en eliminar *espacios en blanco* innecesarios, *saltos de línea* y *comentarios*. En ocasiones también se renombran los nombres de variables (cambiándolas por otros más cortos, como letras) y se optimiza el código eliminando las instrucciones innecesarias o redundantes.

**** Herramientas
Existen varias herramientas para minimizar código. En concreto, para CSS podemos utilizar algunos de los siguientes servicios online:

- https://jakubpawlowicz.github.io/clean-css/ - Optimizador CSS: además de minimizar es capaz de eliminar reglas duplicadas o reestructurar el código
- http://cssminifier.com/
- http://csscompressor.com/
- http://gpbmike.github.io/refresh-sf/

