content/post/minimizacion_css.md
+++
title = "Minimización de hojas de estilo"
date = 2019-10-21T12:39:00+02:00
tags = ["css", "minimizar", "optimizar"]
categories = ["diw", "diw-estilos-multimedia"]
draft = false
+++

La minimización de código tiene como objetivo **reducir el tamaño del archivo eliminando caracteres innecesarios**. Se utiliza en diseño web para reducir el tamaño de los archivos CSS y JavaScript y así reducir el tiempo de carga del sitio web.

<!--more-->

El proceso de minimización es **distinto del de compresión**, ya que el archivo minimizado es totalmente compatible con el original y no requiere de un proceso previo (descompresión) para su correcta interpretación.

El procedimiento consiste en eliminar **espacios en blanco** innecesarios, **saltos de línea** y **comentarios**. En ocasiones también se renombran los nombres de variables (cambiándolas por otros más cortos, como letras) y se optimiza el código eliminando las instrucciones innecesarias o redundantes.


## Herramientas {#herramientas}

Existen varias herramientas para minimizar código. En concreto, para CSS podemos utilizar algunos de los siguientes servicios online:

-   <https://jakubpawlowicz.github.io/clean-css/> - Optimizador CSS: además de minimizar es capaz de eliminar reglas duplicadas o reestructurar el código
-   <http://cssminifier.com/>
-   <http://csscompressor.com/>
-   <http://gpbmike.github.io/refresh-sf/>
